Documents/ВводНачальныхОстатковМалоценкиВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатковМалоценкиВЭксплуатации</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияТоваровНаСкладе</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииМалоценкиВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.МалоценкаВЭксплуатации</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезКого</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускРазрешил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТретийЧленКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МалоценныеАктивы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьУУ</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбособленныеПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыМалоценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыМалоценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МалоценныйБыстроизнашивающийсяПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МалоценныйНеоборотныйАктив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиблиотечныеФонды</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидОперацииИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидОперацииИнвентаризации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Малоценка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводНачальныхОстатковМалоценкиВЭксплуатации/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;

// Хранит вид малоценки МБП
Перем мМБП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Функция формирует табличный документ с типовой печатной формой ОЗ-1
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОЗ1()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"           , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , МоментВремени());
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("Отпустил"         , Отпустил);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Дата                           КАК ДатаАкта,
	|	Док.Номер                          КАК НомерАкта,
	|	Док.Организация.НаименованиеПолное КАК Организация,
	|	Док.ПодразделениеОрганизации       КАК ПринялоПодразделение,
	|	Док.Дата                           КАК ДатаВвода,
	|	КодыОрганизации.КодПоЕДРПОУ        КАК ЕДРПОУ,
	|	ФИООтпустил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + "".""         КАК СдалФИО,
	|	ПРЕДСТАВЛЕНИЕ(РаботникиОрганизаций.Должность)               КАК СдалДолжность,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыОрганизации.СрезПоследних(&НаДату,
	|		                                 Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &Отпустил) КАК ФИООтпустил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    Сотрудник.ФизЛицо = &Отпустил
	|		                    	И Организация = &Организация) КАК РаботникиОрганизаций
	|		ПО Док.ПодразделениеОрганизации = РаботникиОрганизаций.ПодразделениеОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ 
	|	Док.Ссылка = &Ссылка
	|	";
	ВыборкаПоШапке = Запрос.Выполнить().Выбрать();
	ВыборкаПоШапке.Следующий();

													
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка"         , Ссылка);
	Запрос.УстановитьПараметр("НаДату"         , Дата);
	Запрос.УстановитьПараметр("МоментДокумента", МоментВремени());
	Запрос.УстановитьПараметр("Организация"    , Организация);
	Запрос.УстановитьПараметр("Подразделение"  , ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("СчетМЦ"         , ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования);
	Запрос.УстановитьПараметр("Субконто", МассивСубконто);
	
	ВидыМалоценки = Новый Массив;
	ВидыМалоценки.Добавить(Перечисления.ВидыМалоценки.МалоценныйНеоборотныйАктив);
	ВидыМалоценки.Добавить(Перечисления.ВидыМалоценки.БиблиотечныеФонды);
	Запрос.УстановитьПараметр("ВидМалоценки", ВидыМалоценки);
	
	СписокРаботников = МалоценныеАктивы.ВыгрузитьКолонку("ФизЛицо");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(СписокРаботников);
	Запрос.УстановитьПараметр("СписокРаботников", СписокРаботников);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.ФизЛицо.Код                                    КАК КодМОЛа,
	|	ФИОПолучил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОПолучил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОПолучил.Отчество, 1, 1) + ""."" КАК ПолучилФИО,
	|	ПРЕДСТАВЛЕНИЕ(РаботникиОрганизаций.Должность)      КАК ПолучилДолжность,
	|	Док.НазначениеИспользования.СчетБУДляПечати        КАК СчетДт,
	|	Док.Номенклатура.НаименованиеПолное                КАК НаименованиеОС,
	|	ВЫБОР
	|		КОГДА Док.Количество = 0
	|			ТОГДА Док.СтоимостьБУ
	|		ИНАЧЕ ВЫРАЗИТЬ(Док.СтоимостьБУ / Док.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ                                              КАК ПервоначальнаяСтоимость
	|ИЗ
	|	Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо В (&СписокРаботников)) КАК ФИОПолучил
	|		ПО Док.ФизЛицо = ФИОПолучил.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		                    &НаДату,
	|		                    Сотрудник.ФизЛицо В (&СписокРаботников)
	|		                    	И Организация = &Организация) КАК РаботникиОрганизаций
	|		ПО Док.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
	|			И (РаботникиОрганизаций.ПодразделениеОрганизации = &Подразделение)
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|	И Док.НазначениеИспользования.ВидМалоценки В(&ВидМалоценки)";
		
	
	Результат = Запрос.Выполнить();
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВводВЭксплуатациюОС_ОЗ1";
	Макет = ПолучитьОбщийМакет("ОЗ1");
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

    ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Если Результат.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ВыборкаПоКомиссии = РаботаСДиалогами.ПолучитьСведенияОКомиссии(ЭтотОбъект);
	ВыборкаПоОС = Результат.Выбрать();
	
	Пока ВыборкаПоОС.Следующий() Цикл

		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ1");
		Параметры     = ОбластьМакета.Параметры;
		Параметры.Заполнить(ВыборкаПоШапке);
		Параметры.Заполнить(ВыборкаПоКомиссии);
		Параметры.Заполнить(ВыборкаПоОС);
		Параметры.ВидОперации = "Передача в эксплуатацію";
		Параметры.Валюта      = ВалютаРегламентированногоУчета;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;

	ТабДокумент.ОбластьПечати = ТабДокумент.Область(2, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
	Возврат ТабДокумент;

КонецФункции // ПечатьОЗ1()

// Функция формирует печатную форму М-11
//
Функция ПечатьМ11()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , Дата);
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("ЧерезКого"        , ЧерезКого);
	Запрос.УстановитьПараметр("ОтпускРазрешил"   , ОтпускРазрешил);
	Запрос.УстановитьПараметр("Отпустил"         , Отпустил);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Номер                                                   КАК НомерДокумента,
	|	Док.Дата                                                    КАК ДатаДокумента,
	|	Док.Организация                                             КАК Организация,
	|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
	|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
	|	Док.Основание                                               КАК Основание,
	|	КодыОрганизации.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
	|	ФИОЧерезКого.Фамилия + "" ""
	|		+ ФИОЧерезКого.Имя + "" ""
	|		+ ФИОЧерезКого.Отчество                                 КАК ЧерезКого,
	|	ФИОЧерезКого.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОЧерезКого.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОЧерезКого.Отчество, 1, 1) + "".""        КАК ЧерезКогоФИО,
	|	ФИООтпускРазрешил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпускРазрешил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпускРазрешил.Отчество, 1, 1) + "".""   КАК ОтпускРазрешил,
	|	ФИООтпустил.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИООтпустил.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИООтпустил.Отчество, 1, 1) + "".""         КАК Отпустил,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату,
	|			                Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &ЧерезКого) КАК ФИОЧерезКого
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &ОтпускРазрешил) КАК ФИООтпускРазрешил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &Отпустил) КАК ФИООтпустил
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                            И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	                            
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("НаДату"         , Дата);
	Запрос.УстановитьПараметр("ВидМалоценки"   , Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);
	
	СписокРаботников = МалоценныеАктивы.ВыгрузитьКолонку("ФизЛицо");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(СписокРаботников);
	Запрос.УстановитьПараметр("СписокРаботников", СписокРаботников);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФИОКому.Фамилия + "" ""
	|		+ ФИОКому.Имя + "" ""
	|		+ ФИОКому.Отчество                                              КАК Кому,
	|	ФИОКому.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОКому.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОКому.Отчество, 1, 1) + "".""                     КАК КомуФИО,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
	|	ВложенныйЗапрос.Номенклатура.Код                                    КАК НоменклатурныйНомер,
	|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
	|	ВложенныйЗапрос.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
	|	ВложенныйЗапрос.СчетПередачиБУ                                      КАК СчетПередачи,
	|	ВложенныйЗапрос.Количество                                          КАК Количество,
	|	ВложенныйЗапрос.Цена                                                КАК Цена,
	|	ВложенныйЗапрос.СтоимостьБУ                                         КАК Стоимость
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.ФизЛицо                                 КАК Кому,
	|		Док.Номенклатура                            КАК Номенклатура,
	|		Док.НазначениеИспользования.СчетБУДляПечати КАК СчетПередачиБУ,
	|		СУММА(Док.Количество)                       КАК Количество,
	|		СУММА(ВЫБОР
	|				КОГДА Док.Количество = 0
	|					ТОГДА Док.СтоимостьБУ
	|				ИНАЧЕ ВЫРАЗИТЬ(Док.СтоимостьБУ / Док.Количество КАК ЧИСЛО(15, 2))
	|			КОНЕЦ) КАК Цена,
	|		СУММА(Док.СтоимостьБУ)                        КАК СтоимостьБУ
	|	ИЗ
	|		Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
	|	ГДЕ
	|		Док.Ссылка = &ТекущийДокумент
	|		И Док.НазначениеИспользования.ВидМалоценки = &ВидМалоценки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Док.ФизЛицо,
	|		Док.Номенклатура,
	|		Док.НазначениеИспользования.СчетБУДляПечати) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо В (&СписокРаботников)) КАК ФИОКому
	|		ПО ВложенныйЗапрос.Кому = ФИОКому.ФизЛицо
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Стоимость)
	|ПО
	|	Кому";

	ЗапросПоНоменклатуре = Запрос.Выполнить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВводНачальныхОстатковМалоценкиВЭксплуатации_М11";
	
	Макет = ПолучитьОбщийМакет("М11");
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	Если ЗапросПоНоменклатуре.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	ВыборкаКому   = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НеПервый      = Ложь;
	ЕстьЧерезКого = ЗначениеЗаполнено(ЧерезКого);
	ОбластьНомера = Макет.ПолучитьОбласть("Номера");
	
	Пока ВыборкаКому.Следующий()Цикл
		
		Если НеПервый Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		НеПервый = Истина;
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(Шапка);
		Область.Параметры.Кому = ВыборкаКому.Кому;
		Область.Параметры.КодОперации = "Передача в эксплуатацію";	
		Область.Параметры.Валюта      = мВалютаРегламентированногоУчета;
		
		ТабДокумент.Вывести(Область);
		ТабДокумент.Вывести(ОбластьНомера);
		
		ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
		ПараметрыПодвал = ОбластьПодвал.Параметры;
		ПараметрыПодвал.Заполнить(Шапка);
		
		ПрописьВалюты = мВалютаРегламентированногоУчета.ПараметрыПрописиНаУкраинском;
		ПараметрыПодвал.ИтогоСуммаПрописью = ЧислоПрописью(ОбщегоНазначения.ПреобразоватьВЧисло(ВыборкаКому.Стоимость),
		"Л=uk_UA;ДП=Истина;", ПрописьВалюты);
		
		ВыборкаПоСтрокам = ВыборкаКому.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
		КоличествоОбработанных = 1;
		// В форме сказано "Кількість найменувань". Будет выводится количество позиций.
		ПараметрыПодвал.ИтогоКоличествоПрописью = ЧислоПрописью(КоличествоВВыборке, 
		"Л=uk_UA;НП=Ложь;НД=Ложь;", ",,,,,,,,0");
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(ВыборкаПоСтрокам);
			
			Если КоличествоОбработанных = КоличествоВВыборке Тогда
				// Последняя запись. Ее не следует отрывать от подписей.
				
				МассивТаблиц = Новый Массив(2);
				МассивТаблиц[0] = Область;
				МассивТаблиц[1] = ОбластьПодвал;
				
				Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
					
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьНомера);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(Область);
			КоличествоОбработанных = КоличествоОбработанных + 1;
			КомуФИО                = ВыборкаПоСтрокам.КомуФИО;
			
		КонецЦикла;
		
		ПараметрыПодвал.Получил = ?(ЕстьЧерезКого, Шапка.ЧерезКогоФИО, КомуФИО);
		ТабДокумент.Вывести(ОбластьПодвал);
	
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати = ТабДокумент.Область("C2:C" + ТабДокумент.ШиринаТаблицы);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьМ11()

// Функция формирует печатную форму документа
//
Функция ПечатьМШ7()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент"  , Ссылка);
	Запрос.УстановитьПараметр("НаДату"           , Дата);
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("МОЛ"              , Отпустил);
	Запрос.УстановитьПараметр("ГлавныйБухгалтер" , Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Номер                                                   КАК НомерДокумента,
	|	Док.Дата                                                    КАК ДатаДокумента,
	|	Док.Организация                                             КАК Организация,
	|	Док.Организация.НаименованиеПолное                          КАК ПредставлениеОрганизации,
	|	ПРЕДСТАВЛЕНИЕ(Док.ПодразделениеОрганизации)                 КАК Подразделение,
	|	КодыОрганизации.КодПоЕДРПОУ                                 КАК КодПоЕДРПОУ,
	|	ФИОМОЛ.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОМОЛ.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОМОЛ.Отчество, 1, 1) + "".""              КАК МОЛ,
	|	ФИОГлавныйБухгалтер.Фамилия + "" ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Имя, 1, 1) + "". ""
	|		+ ПОДСТРОКА(ФИОГлавныйБухгалтер.Отчество, 1, 1) + ""."" КАК ГлавныйБухгалтер
	|ИЗ
	|	Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.КодыОрганизации.СрезПоследних(
	|			                &НаДату,
	|			                Организация = &Организация) КАК КодыОрганизации
	|		ПО Док.Организация = КодыОрганизации.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			                &НаДату,
	|			                ФизЛицо = &МОЛ) КАК ФИОМОЛ
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		                    &НаДату,
	|		                    ФизЛицо В
	|		                        (ВЫБРАТЬ
	|		                            ОтветственныеЛица.ФизическоеЛицо
	|		                        ИЗ
	|		                            РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|		                                            &НаДату,
	|		                                            СтруктурнаяЕдиница = &Организация
	|		                                И ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛица)
	|		                    ) КАК ФИОГлавныйБухгалтер
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
 	Запрос.УстановитьПараметр("ВидМалоценки"   , Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура.Код                                    КАК НоменклатурныйНомер,
	|	Док.Номенклатура.НаименованиеПолное                     КАК МатериалНаименование,
	|	ПРЕДСТАВЛЕНИЕ(Док.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмеренияНаименование,
	|	Док.Номенклатура.БазоваяЕдиницаИзмерения.Код            КАК ЕдиницаИзмеренияКод,
	|	Док.Количество                                          КАК Количество,
	|	Док.ФизЛицо                                             КАК Сотрудник,
	|	Док.ДатаДокумента                                       КАК ДатаДокумента,
	|	Док.СрокСлужбы                                          КАК СрокСлужбы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.Номенклатура                            КАК Номенклатура,
	|		СУММА(Док.Количество)                       КАК Количество,
	|		МИНИМУМ(Док.НомерСтроки) 		            КАК НомерСтроки,
	|		Док.ФизЛицо                                 КАК ФизЛицо,
	|		Док.Ссылка.Дата                             КАК ДатаДокумента,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования КАК СрокСлужбы
	|	ИЗ
	|		Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
	|	ГДЕ
	|		Док.Ссылка = &ТекущийДокумент
	|		И Док.НазначениеИспользования.ВидМалоценки = &ВидМалоценки
	|
	|	СГРУППИРОВАТЬ ПО
	|		Док.Номенклатура,
	|		Док.ФизЛицо,
	|		Док.Ссылка.Дата,
	|		Док.НазначениеИспользования.СрокПолезногоИспользования) КАК Док
	|
	|УПОРЯДОЧИТЬ ПО НомерСтроки ВОЗР";

	ЗапросПоНоменклатуре = Запрос.Выполнить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВводНачальныхОстатковМалоценкиВЭксплуатации_МШ7";
	
	// Вывод заголовка
	Макет = ПолучитьОбщийМакет("МШ7");
	
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	Если ЗапросПоНоменклатуре.Пустой() Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("НетДанных");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(Шапка);
	Область.Параметры.КодОперации = "Передача в эксплуатацію";	
	
	ОбластьПодвал   = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(Шапка);
	
	ТабДокумент.Вывести(Область);

	ВысотаШапки   = ТабДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабДокумент.ШиринаТаблицы;
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("R" + ВысотаШапки);
	ТабДокумент.ОбластьПечати            = ТабДокумент.Область("C2:C" + ШиринаТаблицы);
	
	ВыборкаПоСтрокам = ЗапросПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоВВыборке     = ВыборкаПоСтрокам.Количество();
	КоличествоОбработанных = 1;
	
	СписокФизическихЛиц = Новый Массив;
	Пока ВыборкаПоСтрокам.Следующий() Цикл
		СписокФизическихЛиц.Добавить(ВыборкаПоСтрокам.Сотрудник);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(СписокФизическихЛиц) Тогда
		ДанныеФизЛица = ОбщегоНазначения.ДанныеСотрудников(Организация, СписокФизическихЛиц, Дата);
	КонецЕсли;
		
	ВыборкаПоСтрокам.Сбросить();
	
	Пока ВыборкаПоСтрокам.Следующий() Цикл

		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(ВыборкаПоСтрокам);
		Область.Параметры.ТабельныйНомер		= "";
		Если ДанныеФизЛица <> Неопределено Тогда
			СтрокаТЗ = ДанныеФизЛица.Найти(ВыборкаПоСтрокам.Сотрудник, "ФизЛицо");
		КонецЕсли;
			
		Если СтрокаТЗ <> Неопределено Тогда
			Область.Параметры.ТабельныйНомер	= СтрокаТЗ.ТабельныйНомер;
		Иначе
		Сообщить(НСтр("ru='Проверьте корректность ввода данных. Не является сотрудником организации - ';uk='Перевірте коректність введення даних. Не є співробітником організації - '") 
							+ ВыборкаПоСтрокам.Сотрудник + "!", СтатусСообщения.Информация);
		КонецЕсли;
		
		Область.Параметры.НомерПП = КоличествоОбработанных;
		
		Если КоличествоОбработанных = КоличествоВВыборке Тогда
			// Последняя запись. Ее не следует отрывать от подписей.
			
			МассивТаблиц = Новый Массив(2);
			МассивТаблиц[0] = Область;
			МассивТаблиц[1] = ОбластьПодвал;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивТаблиц) Тогда
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
        КоличествоОбработанных = КоличествоОбработанных + 1;

	КонецЦикла;

	// Вывод подвала
	ТабДокумент.Вывести(ОбластьПодвал);

	Возврат ТабДокумент;

КонецФункции // ПечатьМШ7()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "МШ7" Тогда
		
		ТабДокумент = ПечатьМШ7();
		
	ИначеЕсли ИмяМакета = "М11" Тогда
		
		ТабДокумент = ПечатьМ11();
		
	ИначеЕсли ИмяМакета = "ОЗ1" Тогда
		
		ТабДокумент = ПечатьОЗ1();
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(Ссылка), Ссылка);
	
КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("МШ7, М11, ОЗ1", 
	                        НСтр("ru='Ведомость МШ-7';uk='Відомість МШ-7'"),
							"Накладная M-11",
							НСтр("ru='Форма ОЗ-1';uk='Форма ОЗ-1'"));

КонецФункции // ПолучитьСтруктуруПечатныхФорм()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , Ложь);
	СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , Ложь);
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	мУчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Отказ, Организация, "Нал");
	
	Если НЕ Отказ Тогда
		
		СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыль" , мУчетнаяПолитикаНУ.СхемаНалогообложения.НалогНаПрибыль = Истина);
		СтруктураШапкиДокумента.Вставить("ЕстьНДС"            , мУчетнаяПолитикаНУ.СхемаНалогообложения.НДС            = Истина);
		
	КонецЕсли;
	
КонецПроцедуры // ПодготовитьПараметрыУчетнойПолитики()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация";
	ДополнитьРеквизитыШапкиРегл(ОбязательныеРеквизитыШапки);
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура дополняет список реквизитов шапки регл. реквизитами
//
Процедура ДополнитьРеквизитыШапкиРегл(Реквизиты)
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		Реквизиты = Реквизиты 
		          + ?(ПустаяСтрока(Реквизиты), "", ", ") 
		          + "ПодразделениеОрганизации";
	КонецЕсли;		  
КонецПроцедуры // ДополнитьРеквизитыШапкиРегл()

// Функция проверяет правильность заполнения документа
// Возврат - структура с данными шапки документа
//
Функция ПроверкаРеквизитов(Отказ, Заголовок) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	Если СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда		
		ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок);
	КонецЕсли;
	
	// Получим данные учетной политики
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок);

	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	РеквизитыТЧ = "Номенклатура, Количество, ФизЛицо, НазначениеИспользования";
	
	Если ОтражатьВУправленческомУчете Тогда
		РеквизитыТЧ = РеквизитыТЧ + ", СтоимостьУУ";
	КонецЕсли;	
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		РеквизитыТЧ = РеквизитыТЧ + ", СтоимостьБУ";
	КонецЕсли;	
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "МалоценныеАктивы", Новый Структура(РеквизитыТЧ), Отказ, Заголовок);
	
	Возврат СтруктураШапкиДокумента;
	
КонецФункции // ПроверкаРеквизитов()

// Проверяет правильность выбора назначений использования, выбранных
// в табличной части.
//
Процедура ПроверитьНазначенияИспользования(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Для каждого СтрокаТЧ Из ТаблицаПоМалоценке Цикл
	
		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Строка номер ""%1"" табличной части ""малоценные активы"": ';uk='Рядок номер ""%1"" табличної частини ""малоцінні активи"": '"), СокрЛП(СтрокаТЧ.НомерСтроки)) + Символы.ПС;
										
		Если СтрокаТЧ.Номенклатура <> СтрокаТЧ.ВладелецНазначения Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Назначение использования <%1> не соответствует номенклатуре <%2>.';uk='Призначення використання <%1> не відповідає номенклатурі <%2>.'"), СтрокаТЧ.НазначениеИспользования, СтрокаТЧ.Номенклатура),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СпособОтраженияРасходов) Тогда
				
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
							 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Способ отражения расходов"".';uk='В призначенні використання <%1> не обраний ""Спосіб відображення витрат"".'"), СтрокаТЧ.НазначениеИспользования),
							 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ВидМалоценки) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Вид малоценки"".';uk='В призначенні використання <%1> не обраний "" Вид малоцінних активів"".'"), СтрокаТЧ.НазначениеИспользования),
			                 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетПередачиБУ) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Счет передачи"".';uk='В призначенні використання <%1> не обраний ""Рахунок передачі"".'"), СтрокаТЧ.НазначениеИспользования),
			                 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
			
		КонецЕсли;
		
		Если (СтрокаТЧ.ВидМалоценки <> мМБП)
			И НЕ ЗначениеЗаполнено(СтрокаТЧ.СчетАмортизацииБУ) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
			                 + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В назначении использования <%1> не выбран ""Счет амортизации"".';uk='В призначенні використання <%1> не обраний ""Рахунок амортизації"".'"), СтрокаТЧ.НазначениеИспользования),
			                 Отказ, Заголовок);
			СтрокаНачалаСообщенияОбОшибке = "";
							 
		КонецЕсли;
		
		Если СтруктураШапкиДокумента.ЕстьНДС Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НалоговоеНазначение) Тогда
					
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Символы.Таб
								 + (НСтр("ru='Не заполнено ""Налоговое назначение"".';uk='Не заповнене ""Податкове призначення"".'")),
								 Отказ, Заголовок);
				СтрокаНачалаСообщенияОбОшибке = "";
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНазначенияИспользования()

// Подготовливает таблицу для проведения.
//
Функция ПодготовитьТаблицуПоМалоценке(СтруктураШапкиДокумента, Отказ, Заголовок)

    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.НомерСтроки                                     КАК НомерСтроки,
	|	Док.Номенклатура                                    КАК Номенклатура,
	|	Док.ХарактеристикаНоменклатуры                      КАК ХарактеристикаНоменклатуры,
	|	Док.СерияНоменклатуры                      			КАК СерияНоменклатуры,
	|	Док.ФизЛицо                                         КАК ФизЛицо,
	|	Док.НазначениеИспользования.СчетПередачиБУ          КАК СчетПередачиБУ,
	|	Док.НазначениеИспользования.СчетАмортизацииБУ       КАК СчетАмортизацииБУ,
	|	Док.НазначениеИспользования                         КАК НазначениеИспользования,
	|	Док.НазначениеИспользования.Владелец                КАК ВладелецНазначения,
	|	Док.НалоговоеНазначение     						КАК НалоговоеНазначение,
	|	Док.НазначениеИспользования.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	Док.НазначениеИспользования.ВидМалоценки            КАК ВидМалоценки,
	|	Док.Количество                                      КАК Количество,
	|	Док.СтоимостьУУ                                     КАК Стоимость,
	|	Док.СтоимостьБУ                                     КАК СтоимостьБУ,
	|	Док.СтоимостьНУ                                     КАК СтоимостьНУ
	|ИЗ
	|	Документ.ВводНачальныхОстатковМалоценкиВЭксплуатации.МалоценныеАктивы КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапкиДокумента.Ссылка );
	
	ТаблицаПоМалоценке = Запрос.Выполнить().Выгрузить();
	
	ПроверитьНазначенияИспользования(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
	
	Возврат ТаблицаПоМалоценке;

КонецФункции 

Процедура ПроверкаАктуальностиУчета(СтруктураШапкиДокумента, Заголовок)
	
	Если Константы.НеИспользоватьДатуАктуальностиУчета.Получить() ИЛИ НЕ Константы.ИнформироватьЕслиУчетНеАктуален.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазделовУчета = Новый Массив;
	// в каких видах учета должен отражаться документ
	ОбщегоНазначения.СообщитьОНеактуальностиУчета(СтруктураШапкиДокумента, МассивРазделовУчета, Заголовок);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// Формирование движений по регистрам по управленческому учету.
//
Процедура ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВУправленческомУчете Тогда
		Возврат;
	КонецЕсли;

	// Движеня ПО РЕГИСТРУ МалоценкаВЭксплуатации.
	НаборДвижений = Движения.МалоценкаВЭксплуатации;
	
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМалоценке, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийМалоценкиВЭксплуатации.СписаниеПартийВЭксплуатацию, "КодОперации");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	НаборДвижений.мПериод            = Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		
		Движения.МалоценкаВЭксплуатации.ВыполнитьПриход();
		
	Иначе
		
		Возврат
		
	КонецЕсли;
	
	// Движеня ПО РЕГИСТРУ ПартииМалоценкиВЭксплуатации.
	НаборДвижений = Движения.ПартииМалоценкиВЭксплуатации;
	
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоМалоценке, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Подразделение, "Подразделение");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка       , "ПартияМалоценкиВЭксплуатации");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка       , "ДокументОприходования");
	ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииМалоценкиВЭксплуатации.СписаниеПартийВЭксплуатацию, "КодОперации");
	ТаблицаДвижений.ЗаполнитьЗначения(Справочники.Качество.Новый, "Качество");
	
	НаборДвижений.мПериод            = Дата;               
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;

	Если Не Отказ Тогда
		
		Движения.ПартииМалоценкиВЭксплуатации.ВыполнитьПриход();
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрамУпр()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ТаблицаПоМалоценке = ПодготовитьТаблицуПоМалоценке(СтруктураШапкиДокумента, Отказ, Заголовок);	
	
	ДвиженияПоРегистрамУпр(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
	
	ДвиженияПоРегистрамБухРегл(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок);
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Формирование движения по регистру бухгалтерии.
//
Процедура ДвиженияПоРегистрамБухРегл(СтруктураШапкиДокумента, ТаблицаПоМалоценке, Отказ, Заголовок)
	
	Если Не СтруктураШапкиДокумента.ОтражатьВБухгалтерскомУчете Тогда
		Возврат;
	КонецЕсли;
	
	ПроводкиБУ   = Движения.Хозрасчетный;
	НомерЖурнала = "МЦ";
	
	Для Каждого СтрокаТЧ Из ТаблицаПоМалоценке Цикл
		
		Если СтрокаТЧ.ВидМалоценки <> мМБП Тогда
			
			СуммаПроводки = СтрокаТЧ.СтоимостьБУ;
			
			// проводка по счету передачи.
			Проводка = ПроводкиБУ.Добавить();                                              
			
			Проводка.Период       = СтруктураШапкиДокумента.Дата;
			Проводка.Организация  = СтруктураШапкиДокумента.Организация;
			Проводка.Содержание   = "Ввод остатков по малоценке";
			Проводка.НомерЖурнала = НомерЖурнала;
			Проводка.Сумма        = СуммаПроводки;
			
			Проводка.СчетДт = СтрокаТЧ.СчетПередачиБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", СтрокаТЧ.Номенклатура);
			Проводка.КоличествоДт = СтрокаТЧ.Количество;
			
			Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначение;
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				
				Если НЕ СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
				
					Проводка.СуммаНУДт = СтрокаТЧ.СтоимостьНУ;	
				
				КонецЕсли;
				
			КонецЕсли;			
			Проводка.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
			
			// проводка по счету амортизации.
			Проводка = ПроводкиБУ.Добавить();
			
			Проводка.Период       = СтруктураШапкиДокумента.Дата;
			Проводка.Организация  = СтруктураШапкиДокумента.Организация;
			Проводка.Содержание   = "Ввод остатков амортизации по малоценке";
			Проводка.НомерЖурнала = НомерЖурнала;
			Проводка.Сумма        = СуммаПроводки;
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.Вспомогательный;
			
			Проводка.СчетКт = СтрокаТЧ.СчетАмортизацииБУ;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", СтрокаТЧ.Номенклатура);
			
			Проводка.НалоговоеНазначениеКт = СтрокаТЧ.НалоговоеНазначение;
			Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
				
				Если НЕ СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
				
					Проводка.СуммаНУКт = СтрокаТЧ.СтоимостьНУ;	
				
				КонецЕсли;
				
			КонецЕсли;			
		КонецЕсли;
		
		// проводка по счету МЦ.
		Проводка = ПроводкиБУ.Добавить();
		
		СуммаПроводки = СтрокаТЧ.СтоимостьБУ;
		
		Проводка.Период       = СтруктураШапкиДокумента.Дата;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Содержание   = "Ввод остатков по малоценке";
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Сумма        = СуммаПроводки;
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций"        , СтрокаТЧ.ФизЛицо);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НазначенияИспользования"     , СтрокаТЧ.НазначениеИспользования);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПартииМалоценкиВЭксплуатации", СтруктураШапкиДокумента.Ссылка);
		Проводка.КоличествоДт = СтрокаТЧ.Количество;
		
		Проводка.НалоговоеНазначениеДт = СтрокаТЧ.НалоговоеНазначение;
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыль Тогда
			
			Если НЕ СтрокаТЧ.НалоговоеНазначение = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
			
				Проводка.СуммаНУДт = СтрокаТЧ.СтоимостьНУ;	
			
			КонецЕсли;
			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрамБухРегл()

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
    	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли; 
	
	Заголовок = "";
	СтруктураШапкиДокумента = ПроверкаРеквизитов(Отказ, Заголовок);
	
	// Движения по документу.
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, Отказ, Заголовок);
		
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();

КонецПроцедуры	// ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	
	Если НЕ УчетнаяПолитика.ЕстьНДС Тогда
		
		// организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из МалоценныеАктивы Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла; 
		
	КонецЕсли; 	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияТоваровНаСкладе") Тогда
		
		Если ДанныеЗаполнения.ВидОперации <> Перечисления.ВидОперацииИнвентаризации.Малоценка Тогда
			Сообщить(Нстр("ru='Неверный вид операции';uk='Невірний вид операції'"));
			Возврат;
		КонецЕсли;
		
		// Заполнение шапки
		ДокументОснование				= ДанныеЗаполнения;
		Организация              		= ДанныеЗаполнения.Организация;
		Комментарий              		= ДанныеЗаполнения.Комментарий;
		Ответственный            		= ПараметрыСеанса.ТекущийПользователь;
		
		// Заполнение табличной части "МалоценныеАктивы"
		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.Малоценка Цикл
			
			НоваяСтрока = МалоценныеАктивы.Добавить();
			
			Номенклатура = СтрокаТЧ.Номенклатура;
			
			НоваяСтрока.Номенклатура                  	= Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры 		= СтрокаТЧ.ХарактеристикаНоменклатуры;
			НоваяСтрока.СерияНоменклатуры          		= СтрокаТЧ.СерияНоменклатуры;
			
			спрНазначение =  Справочники.НазначенияИспользования.Выбрать(,Номенклатура);
			спрНазначение.Следующий();
			НоваяСтрока.НазначениеИспользования 		= спрНазначение.Ссылка;
			
			НоваяСтрока.ЕдиницаИзмерения           		= СтрокаТЧ.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент                		= СтрокаТЧ.Коэффициент;
			НоваяСтрока.ФизЛицо 				      	= ДанныеЗаполнения.ФизЛицо;
			НоваяСтрока.Количество                    	= СтрокаТЧ.Количество;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 
// 

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мМБП                            = Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет;
